#include "adc.h"

/**************************************************************
*函数功能：ADC1_CH10配置
*参    数：None
*返 回 值：None
*备    注：PC0-----ADC1_CH10
**************************************************************/
void ADC1_CH10_Init(void)
{
	///打开时钟
	RCC->AHB1ENR |= (1<<2);
	RCC->APB2ENR |= (1<<8);
	//配置GPIO控制器
	GPIOC->MODER &= ~(3<<0);
	GPIOC->MODER |= (3<<0);//模拟
	//配置ADC控制器
	//CR1
	ADC1->CR1 &= ~(3<<24);//12位分辨率
	ADC1->CR1 &= ~(1<<8);//非扫描
	//CR2
	ADC1->CR2 &= ~(1<<11);//右对齐
	ADC1->CR2 &= ~(1<<1);//单次转换
	//SMPR
	ADC1->SMPR1 &= ~(7<<0);
	ADC1->SMPR1 |= (7<<0);//配置CH10采样周期
	//SQR
	ADC1->SQR1 &= ~(0xf<<20);//转换总数
	ADC1->SQR3 &= ~(0x1f<<0);
	ADC1->SQR3 |= (10<<0);//通道10填入序列1
	//CCR
	ADC->CCR &= ~(3<<16);
	ADC->CCR |= (1<<16);//时钟分频  4分频
	
	ADC1->CR2 |= (1<<0);//开启ADC
}



/**************************************************************
*函数功能：ADC2_CH12配置
*参    数：None
*返 回 值：None
*备    注：PC2-----ADC2_CH12
**************************************************************/
void ADC2_CH12_Init(void)
{
	///打开时钟
	RCC->AHB1ENR |= (1<<2);
	RCC->APB2ENR |= (1<<9);
	//配置GPIO控制器
	GPIOC->MODER &= ~(3<<4);
	GPIOC->MODER |= (3<<4);//模拟
	//配置ADC控制器
	//CR1
	ADC2->CR1 &= ~(3<<24);//12位分辨率
	ADC2->CR1 &= ~(1<<8);//非扫描
	//CR2
	ADC2->CR2 &= ~(1<<11);//右对齐
	ADC2->CR2 &= ~(1<<1);//单次转换
	//SMPR
	ADC2->SMPR1 &= ~(7<<6);
	ADC2->SMPR1 |= (7<<6);//配置CH12采样周期
	//SQR
	ADC2->SQR1 &= ~(0xf<<20);//转换总数
	ADC2->SQR3 &= ~(0x1f<<0);
	ADC2->SQR3 |= (12<<0);//通道10填入序列1
	//CCR
	ADC->CCR &= ~(3<<16);
	ADC->CCR |= (1<<16);//时钟分频  4分频
	
	ADC2->CR2 |= (1<<0);//开启ADC
}



/**************************************************************
*函数功能：ADC1_CH10_CH12配置
*参    数：None
*返 回 值：None
*备    注：PC0-----ADC1_CH10   PC2----ADC1_CH12
**************************************************************/
void ADC1_CH10_CH12_Init(void)
{
	///打开时钟
	RCC->AHB1ENR |= (1<<2);
	RCC->APB2ENR |= (1<<8);
	//配置GPIO控制器
	GPIOC->MODER &= ~(3<<0);
	GPIOC->MODER |= (3<<0);//模拟
	GPIOC->MODER &= ~(3<<4);
	GPIOC->MODER |= (3<<4);//模拟
	//配置ADC控制器
	//CR1
	ADC1->CR1 &= ~(3<<24);//12位分辨率
	ADC1->CR1 |= (1<<8);//扫描
	//CR2
	ADC1->CR2 &= ~(1<<11);//右对齐
	ADC1->CR2 |= (1<<10);//每一个通道转换结束EOC位置1
	ADC1->CR2 &= ~(1<<1);//单次转换
	//SMPR
	ADC1->SMPR1 &= ~(7<<0);
	ADC1->SMPR1 |= (7<<0);//配置CH10采样周期
	ADC1->SMPR1 &= ~(7<<6);
	ADC1->SMPR1 |= (7<<6);//配置CH12采样周期
	//SQR
	ADC1->SQR1 &= ~(0xf<<20);
	ADC1->SQR1 |= (1<<20);//转换总数2次
	
	ADC1->SQR3 &= ~(0x1f<<0);
	ADC1->SQR3 |= (10<<0);//通道10填入序列1
	ADC1->SQR3 &= ~(0x1f<<5);
	ADC1->SQR3 |= (12<<5);//通道12填入序列2
	
	//CCR
	ADC->CCR &= ~(3<<16);
	ADC->CCR |= (1<<16);//时钟分频  4分频
	
	ADC1->CR2 |= (1<<0);//开启ADC
}



/**************************************************************
*函数功能：ADC1_CH10_CH12_T配置
*参    数：None
*返 回 值：None
*备    注：PC0-----ADC1_CH10   PC2----ADC1_CH12   TEMP---ADC1_CH16
**************************************************************/
void ADC1_CH10_CH12_T_Init(void)
{
	///打开时钟
	RCC->AHB1ENR |= (1<<2);
	RCC->APB2ENR |= (1<<8);
	//配置GPIO控制器
	GPIOC->MODER &= ~(3<<0);
	GPIOC->MODER |= (3<<0);//模拟
	GPIOC->MODER &= ~(3<<4);
	GPIOC->MODER |= (3<<4);//模拟
	//配置ADC控制器
	//CR1
	ADC1->CR1 &= ~(3<<24);//12位分辨率
	ADC1->CR1 |= (1<<8);//扫描
	//CR2
	ADC1->CR2 &= ~(1<<11);//右对齐
	ADC1->CR2 |= (1<<10);//每一个通道转换结束EOC位置1
	ADC1->CR2 &= ~(1<<1);//单次转换
	//SMPR
	ADC1->SMPR1 &= ~(7<<0);
	ADC1->SMPR1 |= (7<<0);//配置CH10采样周期
	ADC1->SMPR1 &= ~(7<<6);
	ADC1->SMPR1 |= (7<<6);//配置CH12采样周期
	ADC1->SMPR1 &= ~(7<<18);
	ADC1->SMPR1 |= (7<<18);//配置CH16采样周期
	//SQR
	ADC1->SQR1 &= ~(0xf<<20);
	ADC1->SQR1 |= (2<<20);//转换总数3次
	
	ADC1->SQR3 &= ~(0x1f<<0);
	ADC1->SQR3 |= (10<<0);//通道10填入序列1
	ADC1->SQR3 &= ~(0x1f<<5);
	ADC1->SQR3 |= (12<<5);//通道12填入序列2
	ADC1->SQR3 &= ~(0x1f<<10);
	ADC1->SQR3 |= (16<<10);//通道16填入序列3
	
	//CCR
	ADC->CCR &= ~(3<<16);
	ADC->CCR |= (1<<16);//时钟分频  4分频
	ADC->CCR |= (1<<23);//温度传感器使能
	
	ADC1->CR2 |= (1<<0);//开启ADC
}

/**************************************************************
*函数功能：ADC1_CH10_CH12配置（中断）
*参    数：None
*返 回 值：None
*备    注：PC0-----ADC1_CH10   PC2----ADC1_CH12
**************************************************************/
void ADC1_CH10_CH12_Interrupt_Init(void)
{
	///打开时钟
	RCC->AHB1ENR |= (1<<2);
	RCC->APB2ENR |= (1<<8);
	//配置GPIO控制器
	GPIOC->MODER &= ~(3<<0);
	GPIOC->MODER |= (3<<0);//模拟
	GPIOC->MODER &= ~(3<<4);
	GPIOC->MODER |= (3<<4);//模拟
	//配置ADC控制器
	//CR1
	ADC1->CR1 &= ~(3<<24);//12位分辨率
	ADC1->CR1 |= (1<<8);//扫描
	ADC1->CR1 |= (1<<5);//使能EOC的中断控制位
	//CR2
	ADC1->CR2 &= ~(1<<11);//右对齐
	ADC1->CR2 |= (1<<10);//每一个通道转换结束EOC位置1
	ADC1->CR2 &= ~(1<<1);//单次转换
	//SMPR
	ADC1->SMPR1 &= ~(7<<0);
	ADC1->SMPR1 |= (7<<0);//配置CH10采样周期
	ADC1->SMPR1 &= ~(7<<6);
	ADC1->SMPR1 |= (7<<6);//配置CH12采样周期
	//SQR
	ADC1->SQR1 &= ~(0xf<<20);
	ADC1->SQR1 |= (1<<20);//转换总数2次
	
	ADC1->SQR3 &= ~(0x1f<<0);
	ADC1->SQR3 |= (10<<0);//通道10填入序列1
	ADC1->SQR3 &= ~(0x1f<<5);
	ADC1->SQR3 |= (12<<5);//通道12填入序列2
	
	//CCR
	ADC->CCR &= ~(3<<16);
	ADC->CCR |= (1<<16);//时钟分频  4分频
	
	NVIC_SetPriority(ADC_IRQn,NVIC_EncodePriority(5,2,1));
	NVIC_EnableIRQ(ADC_IRQn);
	
	ADC1->CR2 |= (1<<0);//开启ADC
}







