#include "sg90.h"

/**************************************************************
*函数功能：SG90舵机配置
*参    数：None
*返 回 值：None
*备    注：APB1---42MHz    TIM2---84MHz  PB10--TIM2_CH3
**************************************************************/
void SG90_Init(void)
{
	RCC->AHB1ENR |= (1<<1);
	RCC->APB1ENR |= (1<<0);
	
	GPIOB->MODER &= ~(0x3<<20);
	GPIOB->MODER |= (0x2<<20);
	
	GPIOB->AFR[1] &= ~(0xf<<8);
	GPIOB->AFR[1] |= (1<<8);
	
	//TIM2
	TIM2->PSC = 840 - 1;//记一个数为10us
	TIM2->ARR = 2000 - 1;//一个计数周期为20ms
	
	TIM2->CR1 |= (1<<7);//配置自动重载预装载（缓冲）
	TIM2->CR1 &= ~(0x3<<5);//边沿对齐模式
	TIM2->CR1 &= ~(1<<4);//方向：递增
	TIM2->CR1 &= ~(1<<3);//单脉冲模式关闭
//	TIM2->CR1 &= ~(1<<2);//更新请求源
	TIM2->CR1 &= ~(1<<1);//使能UEV
	TIM2->EGR |= (1<<0);//手动产生一个更新事件（把值更新）
	TIM2->SR &= ~(1<<0);//清除标志位
	
	//配置通道
	//CCMR1
	TIM2->CCMR2 &= ~(0x7<<4);
	TIM2->CCMR2 |= (0x6<<4);//配置PWM1模式
	TIM2->CCMR2 &= ~(1<<3);//输出比较 1 预装载使能
	TIM2->CCMR2 &= ~(0x3<<0);//CC1 通道配置为输出
	//CCER
	TIM2->CCER &= ~(1<<11);//输出CC1NP 必须保持清零
	TIM2->CCER &= ~(1<<9);//有效电平为高电平
	TIM2->CCER |= (1<<8);//通道使
	
	//CCR1
	TIM2->CCR3 = 50;
	
	TIM2->CR1 |= (1<<0);//使能计数器
	
}
//T:  20ms---2000
//0:  0.5ms--50
//180:2.5ms--250
void SG90_Contorl(u16 angle)
{
	TIM2->CCR3 = angle;
}



