#include "tim6.h"

/**************************************************************
*函数功能：TIM6延时函数
*参    数：None
*返 回 值：None
*备    注：APB1---42MHz    TIM6---84MHz   xms最大6553ms
**************************************************************/
void Tim6_Delay_ms(u32 xms)
{
	//开启时钟
	RCC->APB1ENR |= (1 << 4);
	//CR1
	TIM6->CR1 |= (1 << 7);//配置自动重载预装载（缓冲）
	TIM6->CR1 |= (1 << 3);//单脉冲模式打开
	//	TIM6->CR1 &= ~(1<<2);//更新请求源
	TIM6->CR1 &= ~(1 << 1);//更新禁止位
	//时基单元
	TIM6->PSC = 8400 - 1;//填入分频值0.1ms
	TIM6->ARR = 10 * xms - 1;//填入重装载值

	TIM6->EGR |= (1 << 0);//手动产生一个更新事件（把值更新）
	//SR
	//清除标志
	TIM6->SR &= ~(1 << 0);
	//	使能计数器	
	TIM6->CR1 |= (1 << 0);
	//等待计数完成：等待SR中UIF位置1跳出
	while (!(TIM6->SR & (1 << 0)));
}

