#include "tim7.h"

/**************************************************************
*函数功能：TIM7定时中断配置
*参    数：None
*返 回 值：None
*备    注：APB1---42MHz    TIM7---84MHz
**************************************************************/
void Tim7_IRQ_Config(u32 xms)
{
	//开启时钟
	RCC->APB1ENR |= (1 << 5);
	//CR1
	TIM7->CR1 |= (1 << 7);//配置自动重载预装载（缓冲）
	TIM7->CR1 &= ~(1 << 3);//单脉冲模式关闭
	TIM7->CR1 |= (1 << 2);//更新请求源、只能上溢触发中断
	TIM7->CR1 &= ~(1 << 1);//更新禁止位

	TIM7->DIER |= (1 << 0);//打开中断使能位
	//时基单元
	TIM7->PSC = 8400 - 1;//填入分频值0.1ms
	TIM7->ARR = 10 * xms - 1;//填入重装载值

	TIM7->EGR |= (1 << 0);//手动产生一个更新事件（把值更新,计数器初始化）
	//SR
	//清除标志
	TIM7->SR &= ~(1 << 0);

	//NVIC
	NVIC_SetPriority(TIM7_IRQn, NVIC_EncodePriority(5, 1, 2));
	NVIC_EnableIRQ(TIM7_IRQn);
	//	使能计数器	
	TIM7->CR1 |= (1 << 0);

}



